# Pandas

In [1]:
import pandas as pd

## Dataframe

In [2]:
data = {'Country': ['Belgium',  'India',  'Brazil'],
        'Capital': ['Brussels',  'New Delhi',  'Brasilia'],
        'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

## Reading a CSV file

In [3]:
df = pd.read_csv('./data/penguins_size.csv')
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [4]:
df.head(10)

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN

In [5]:
df.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [6]:
len(df)

344

In [7]:
df.shape

(344, 7)

In [8]:
df.columns

Index(['species', 'island', 'culmen_length_mm', 'culmen_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

In [9]:
df.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000

In [10]:
df.iloc[0]

species                 Adelie
island               Torgersen
culmen_length_mm          39.1
culmen_depth_mm           18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       MALE
Name: 0, dtype: object

In [11]:
df.iloc[69:150]

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
69,Adelie,Torgersen,41.8,19.4,198.0,4450.0,MALE
70,Adelie,Torgersen,33.5,19.0,190.0,3600.0,FEMALE
71,Adelie,Torgersen,39.7,18.4,190.0,3900.0,MALE
72,Adelie,Torgersen,39.6,17.2,196.0,3550.0,FEMALE
73,Adelie,Torgersen,45.8,18.9,197.0,4150.0,MALE
...,...,...,...,...,...,...,...
145,Adelie,Dream,39.0,18.7,185.0,3650.0,MALE
146,Adelie,Dream,39.2,18.6,190.0,4250.0,MALE
147,Adelie,Dream,36.6,18.4,184.0,3475.0,FEMALE
148,Adelie,Dream,36.0,17.8,195.0,3450.0,FEMALE
149,Adelie,Dream,37.8,18.1,193.0,3750.0,MALE

In [12]:
df.iloc[0,3]

18.7

In [13]:
df.iloc[:,3]

0      18.7
1      17.4
2      18.0
3       NaN
4      19.3
       ...
339     NaN
340    14.3
341    15.7
342    14.8
343    16.1
Name: culmen_depth_mm, Length: 344, dtype: float64

In [14]:
df['culmen_depth_mm']

0      18.7
1      17.4
2      18.0
3       NaN
4      19.3
       ...
339     NaN
340    14.3
341    15.7
342    14.8
343    16.1
Name: culmen_depth_mm, Length: 344, dtype: float64

In [15]:
df1 = pd.read_csv('./data/penguins_size.csv', index_col = 'culmen_length_mm')
df1.head()

,species,island,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
culmen_length_mm,,,,,,
39.1,Adelie,Torgersen,18.7,181.0,3750.0,MALE
39.5,Adelie,Torgersen,17.4,186.0,3800.0,FEMALE
40.3,Adelie,Torgersen,18.0,195.0,3250.0,FEMALE
NaN,Adelie,Torgersen,NaN,NaN,NaN,NaN
36.7,Adelie,Torgersen,19.3,193.0,3450.0,FEMALE

In [16]:
df1.loc[39.5]

,species,island,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
culmen_length_mm,,,,,,
39.5,Adelie,Torgersen,17.4,186.0,3800.0,FEMALE
39.5,Adelie,Dream,16.7,178.0,3250.0,FEMALE
39.5,Adelie,Dream,17.8,188.0,3300.0,FEMALE

### Inserting a row

In [17]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [18]:
df.loc[4]

species                 Adelie
island               Torgersen
culmen_length_mm          36.7
culmen_depth_mm           19.3
flipper_length_mm        193.0
body_mass_g             3450.0
sex                     FEMALE
Name: 4, dtype: object

In [19]:
df.loc[len(df)-1]

species              Gentoo
island               Biscoe
culmen_length_mm       49.9
culmen_depth_mm        16.1
flipper_length_mm     213.0
body_mass_g          5400.0
sex                    MALE
Name: 343, dtype: object

In [20]:
df.loc[len(df)] = ['random', 'random', 0,0,0,0,'MALE']
df.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE
344,random,random,0.0,0.0,0.0,0.0,MALE

### Modifying a row

In [21]:
df.loc[341] = ['random', 'random', 0,0,0,0,'MALE']
df.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,random,random,0.0,0.0,0.0,0.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE
344,random,random,0.0,0.0,0.0,0.0,MALE

### Deleting a row

In [22]:
df.drop(341, inplace = True)
df.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE
344,random,random,0.0,0.0,0.0,0.0,MALE

In [23]:
df.drop([339,340], inplace = True)
df.tail()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE
344,random,random,0.0,0.0,0.0,0.0,MALE

### Deleting a column

In [24]:
df.drop(['body_mass_g'], axis = 1, inplace = True)
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,sex
0,Adelie,Torgersen,39.1,18.7,181.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,FEMALE

### Filtering in a dataframe

Task: Find out all rows that have culmen_length_mm < 40

Using for loop

In [25]:
filtered_df = pd.DataFrame(columns = df.columns)
filtered_df.head()

Empty DataFrame
Columns: [species, island, culmen_length_mm, culmen_depth_mm, flipper_length_mm, sex]
Index: []

In [26]:
%time
filtered_df = pd.DataFrame(columns = df.columns)
for i in range(len(df)):
  if (df['culmen_length_mm'].iloc[i] < 40):
    filtered_df.loc[len(filtered_df)] = df.iloc[i]
print(len(filtered_df))
filtered_df.head()

CPU times: user 1e+03 ns, sys: 0 ns, total: 1e+03 ns
Wall time: 2.86 µs
101

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,sex
0,Adelie,Torgersen,39.1,18.7,181.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,FEMALE
2,Adelie,Torgersen,36.7,19.3,193.0,FEMALE
3,Adelie,Torgersen,39.3,20.6,190.0,MALE
4,Adelie,Torgersen,38.9,17.8,181.0,FEMALE

In [27]:
df['culmen_length_mm']<40

0       True
1       True
2      False
3      False
4       True
       ...
337    False
338    False
342    False
343    False
344     True
Name: culmen_length_mm, Length: 342, dtype: bool

In [28]:
 type(df[df['culmen_length_mm']<40])

pandas.core.frame.DataFrame

In [29]:
%time
filtered_df = df[df['culmen_length_mm']<40]
print(len(filtered_df))
filtered_df.head()

CPU times: user 1e+03 ns, sys: 0 ns, total: 1e+03 ns
Wall time: 3.1 µs
101

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,sex
0,Adelie,Torgersen,39.1,18.7,181.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,MALE
6,Adelie,Torgersen,38.9,17.8,181.0,FEMALE

## Applying a function to all the rows or columns

Task: add 2 to each culmen_length_mm

### Using for loop

In [30]:
%time
df['culmen_length_mm'] = [x+2 for x in df['culmen_length_mm']]
df.head()

CPU times: user 1 µs, sys: 1e+03 ns, total: 2 µs
Wall time: 1.91 µs

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,sex
0,Adelie,Torgersen,41.1,18.7,181.0,MALE
1,Adelie,Torgersen,41.5,17.4,186.0,FEMALE
2,Adelie,Torgersen,42.3,18.0,195.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,38.7,19.3,193.0,FEMALE

### Using df.apply

In [31]:
%time
def add2(x):
  return x+2

df['culmen_length_mm'] = df['culmen_length_mm'].apply(add2)

df.head()

CPU times: user 1e+03 ns, sys: 0 ns, total: 1e+03 ns
Wall time: 3.1 µs

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,sex
0,Adelie,Torgersen,43.1,18.7,181.0,MALE
1,Adelie,Torgersen,43.5,17.4,186.0,FEMALE
2,Adelie,Torgersen,44.3,18.0,195.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,40.7,19.3,193.0,FEMALE

### Cleaning and getting insights from the dataset

In [32]:
df = pd.read_csv('./data/penguins_size.csv')
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [34]:
df.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000

### Removing duplicates

In [35]:
df = df.drop_duplicates()

### Checking for null values

In [36]:
df.isnull().sum()

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [37]:
df_null = df[df['sex'].isnull()]
df_null

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [38]:
df.drop([3,339], inplace = True)
df.isnull().sum()

species              0
island               0
culmen_length_mm     0
culmen_depth_mm      0
flipper_length_mm    0
body_mass_g          0
sex                  8
dtype: int64

In [39]:
df['sex'].value_counts()

MALE      168
FEMALE    165
.           1
Name: sex, dtype: int64

In [40]:
df1 = df.dropna()

In [41]:
len(df1)

334

In [42]:
df['sex'] = df['sex'].fillna('MALE')
df['sex'].replace({".": 'MALE'}, inplace=True)
df.isnull().sum()

species              0
island               0
culmen_length_mm     0
culmen_depth_mm      0
flipper_length_mm    0
body_mass_g          0
sex                  0
dtype: int64

In [43]:
df['sex'].value_counts()

MALE      177
FEMALE    165
Name: sex, dtype: int64

In [44]:
df['species'].value_counts()

Adelie       151
Gentoo       123
Chinstrap     68
Name: species, dtype: int64